{"class_name": "Model", "config": {"name": "model_13", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "neighbourhood_group"}, "name": "neighbourhood_group", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "neighbourhood"}, "name": "neighbourhood", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_39", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_39", "inbound_nodes": [[["neighbourhood_group", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_40", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 221, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_40", "inbound_nodes": [[["neighbourhood", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "room_type"}, "name": "room_type", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_39", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_39", "inbound_nodes": [[["embedding_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_40", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_40", "inbound_nodes": [[["embedding_40", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_41", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_41", "inbound_nodes": [[["room_type", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_39", "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_40", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_40", "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_41", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_41", "inbound_nodes": [[["embedding_41", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_39", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_39", "inbound_nodes": [[["flatten_39", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_40", "inbound_nodes": [[["flatten_40", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_41", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_41", "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_78", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_78", "inbound_nodes": [[["dropout_39", 0, 0, {}], ["dropout_40", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_41", "inbound_nodes": [[["flatten_41", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_79", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_79", "inbound_nodes": [[["concatenate_78", 0, 0, {}], ["dropout_41", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "minimum_nights"}, "name": "minimum_nights", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_80", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_80", "inbound_nodes": [[["concatenate_79", 0, 0, {}], ["minimum_nights", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "number_of_reviews"}, "name": "number_of_reviews", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_81", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_81", "inbound_nodes": [[["concatenate_80", 0, 0, {}], ["number_of_reviews", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "reviews_per_month"}, "name": "reviews_per_month", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_82", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_82", "inbound_nodes": [[["concatenate_81", 0, 0, {}], ["reviews_per_month", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "calculated_host_listings_count"}, "name": "calculated_host_listings_count", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_83", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_83", "inbound_nodes": [[["concatenate_82", 0, 0, {}], ["calculated_host_listings_count", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["concatenate_83", 0, 0, {}]]]}], "input_layers": [["neighbourhood_group", 0, 0], ["neighbourhood", 0, 0], ["room_type", 0, 0], ["minimum_nights", 0, 0], ["number_of_reviews", 0, 0], ["reviews_per_month", 0, 0], ["calculated_host_listings_count", 0, 0]], "output_layers": [["dense_13", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}